# Selecting Rows and Columns

For this exercise we will be working with `yob_1880.csv` file.

### 1. Read Data

Import pandas

In [30]:
import pandas as pd

Locate the `yob_1880.csv`file and read it in `df`dataframe.

In [31]:
df = pd.read_csv('./data/yob1880.csv')

### 2. Inspect Data

How many columns and rows are there in the dataframe?

In [36]:
df.info

<bound method DataFrame.info of            name gender  frequency
0          Mary      F       7065
1          Anna      F       2604
2          Emma      F       2003
3     Elizabeth      F       1939
4        Minnie      F       1746
...         ...    ...        ...
1995     Woodie      M          5
1996     Worthy      M          5
1997     Wright      M          5
1998       York      M          5
1999  Zachariah      M          5

[2000 rows x 3 columns]>

Display the first 3 rows.

In [37]:
df.head(3)

   name gender  frequency
0  Mary      F       7065
1  Anna      F       2604
2  Emma      F       2003

Display the last 3 rows.

In [38]:
df.tail(3)

           name gender  frequency
1997     Wright      M          5
1998       York      M          5
1999  Zachariah      M          5

### 3. Select Columns

Display only the `gender`column

In [39]:
df['gender']

0       F
1       F
2       F
3       F
4       F
       ..
1995    M
1996    M
1997    M
1998    M
1999    M
Name: gender, Length: 2000, dtype: object

Display `gender`and `frequency`columns. Display only first 3 rows with these columns.

In [40]:
df[['gender', 'frequency']].head(3)

  gender  frequency
0      F       7065
1      F       2604
2      F       2003

### 4. Select Rows

Display data for row(s) containing `Anna`

In [41]:
df.set_index('name', inplace=True)

In [42]:
df.loc['Anna']

     gender  frequency
name
Anna      F       2604
Anna      M         12

Display the data for all rows with `William`, `Paul`, and `Anne`.

In [43]:
df.loc[['William','Paul','Anne']]

        gender  frequency
name
William      F         30
William      M       9532
Paul         M        301
Anne         F        136

Display the `frequency` column for `William`, `Paul`, and `Anne`.

In [44]:
df.loc[['William','Paul','Anne']]['frequency']

name
William      30
William    9532
Paul        301
Anne        136
Name: frequency, dtype: int64

Display both columns for every second name.

In [45]:
df.loc[::2]

        gender  frequency
name
Mary         F       7065
Emma         F       2003
Minnie       F       1746
Ida          F       1472
Bertha       F       1320
...        ...        ...
Unknown      M          5
Wes          M          5
Wood         M          5
Worthy       M          5
York         M          5

[1000 rows x 2 columns]

Set index to column `gender`and store it in another dataframe.

In [33]:
df_gender = df.set_index('gender')
df_gender

             name  frequency
gender
F            Mary       7065
F            Anna       2604
F            Emma       2003
F       Elizabeth       1939
F          Minnie       1746
...           ...        ...
M          Woodie          5
M          Worthy          5
M          Wright          5
M            York          5
M       Zachariah          5

[2000 rows x 2 columns]

Display first 3 rows of this new dataframe where `gender` is `M`

In [34]:
df_gender.loc['M'].head(3)

           name  frequency
gender
M          John       9655
M       William       9532
M         James       5927